sobriodev/LEGO_SmartCity/board/pin_mux.c
	const uint32_t port2_pin28_config = (/* Pin is configured as LCD_VD(10) */
			IOCON_PIO_FUNC1 |
			/* No addition pin function */
			IOCON_PIO_MODE_INACT |
			/* Input function is not inverted */
			IOCON_PIO_INV_DI |
			/* Enables digital function */
			IOCON_PIO_DIGITAL_EN |
			/* Input filter disabled */
			IOCON_PIO_INPFILT_OFF |
			/* Standard mode, output slew rate control is enabled */
			IOCON_PIO_SLEW_STANDARD |
			/* Open drain is disabled */
			IOCON_PIO_OPENDRAIN_DI);
	/* PORT2 PIN28 (coords: G13) is configured as LCD_VD(10) */
	IOCON_PinMuxSet(IOCON, 2U, 28U, port2_pin28_config);

	const uint32_t port2_pin29_config = (/* Pin is configured as LCD_VD(11) */
			IOCON_PIO_FUNC1 |
			/* No addition pin function */
			IOCON_PIO_MODE_INACT |
			/* Input function is not inverted */
			IOCON_PIO_INV_DI |
			/* Enables digital function */
			IOCON_PIO_DIGITAL_EN |
			/* Input filter disabled */
			IOCON_PIO_INPFILT_OFF |
			/* Standard mode, output slew rate control is enabled */
			IOCON_PIO_SLEW_STANDARD |
			/* Open drain is disabled */
			IOCON_PIO_OPENDRAIN_DI);
	/* PORT2 PIN29 (coords: G11) is configured as LCD_VD(11) */
	IOCON_PinMuxSet(IOCON, 2U, 29U, port2_pin29_config);

	const uint32_t port2_pin30_config = (/* Pin is configured as LCD_VD(12) */
			IOCON_PIO_FUNC1 |
			/* No addition pin function */
			IOCON_PIO_MODE_INACT |
			/* Input function is not inverted */
			IOCON_PIO_INV_DI |
			/* Enables digital function */
			IOCON_PIO_DIGITAL_EN |
			/* Input filter disabled */
			IOCON_PIO_INPFILT_OFF |
			/* Standard mode, output slew rate control is enabled */
			IOCON_PIO_SLEW_STANDARD |
			/* Open drain is disabled */
			IOCON_PIO_OPENDRAIN_DI);
	/* PORT2 PIN30 (coords: F12) is configured as LCD_VD(12) */
	IOCON_PinMuxSet(IOCON, 2U, 30U, port2_pin30_config);

	const uint32_t port2_pin31_config = (/* Pin is configured as LCD_VD(13) */
			IOCON_PIO_FUNC1 |
			/* No addition pin function */
			IOCON_PIO_MODE_INACT |
			/* Input function is not inverted */
			IOCON_PIO_INV_DI |
			/* Enables digital function */
			IOCON_PIO_DIGITAL_EN |
			/* Input filter disabled */
			IOCON_PIO_INPFILT_OFF |
			/* Standard mode, output slew rate control is enabled */
			IOCON_PIO_SLEW_STANDARD |
			/* Open drain is disabled */
			IOCON_PIO_OPENDRAIN_DI);
	/* PORT2 PIN31 (coords: D14) is configured as LCD_VD(13) */
	IOCON_PinMuxSet(IOCON, 2U, 31U, port2_pin31_config);

	const uint32_t port3_pin0_config = (/* Pin is configured as LCD_VD(14) */
			IOCON_PIO_FUNC1 |
			/* No addition pin function */
			IOCON_PIO_MODE_INACT |
			/* Input function is not inverted */
			IOCON_PIO_INV_DI |
			/* Enables digital function */
			IOCON_PIO_DIGITAL_EN |
			/* Input filter disabled */
			IOCON_PIO_INPFILT_OFF |
			/* Standard mode, output slew rate control is enabled */
			IOCON_PIO_SLEW_STANDARD |
			/* Open drain is disabled */
			IOCON_PIO_OPENDRAIN_DI);
	/* PORT3 PIN0 (coords: D12) is configured as LCD_VD(14) */
	IOCON_PinMuxSet(IOCON, 3U, 0U, port3_pin0_config);

	const uint32_t port3_pin1_config = (/* Pin is configured as LCD_VD(15) */
			IOCON_PIO_FUNC1 |
			/* No addition pin function */
			IOCON_PIO_MODE_INACT |
			/* Input function is not inverted */
			IOCON_PIO_INV_DI |
			/* Enables digital function */
			IOCON_PIO_DIGITAL_EN |
			/* Input filter disabled */
			IOCON_PIO_INPFILT_OFF |
			/* Standard mode, output slew rate control is enabled */
			IOCON_PIO_SLEW_STANDARD |
			/* Open drain is disabled */
			IOCON_PIO_OPENDRAIN_DI);
	/* PORT3 PIN1 (coords: D11) is configured as LCD_VD(15) */
	IOCON_PinMuxSet(IOCON, 3U, 1U, port3_pin1_config);

	const uint32_t port3_pin23_config = (/* Pin is configured as FC2_CTS_SDA_SSEL0 */
			IOCON_PIO_FUNC1 |
			/* I2C mode */
			IOCON_PIO_I2CSLEW_I2C |
			/* Input function is not inverted */
			IOCON_PIO_INV_DI |
			/* Enables digital function */
			IOCON_PIO_DIGITAL_EN |
			/* Input filter disabled */
			IOCON_PIO_INPFILT_OFF |
			/* High drive: 20 mA */
			IOCON_PIO_I2CDRIVE_HIGH |
			/* I2C 50 ns glitch filter enabled */
			IOCON_PIO_I2CFILTER_EN);
	/* PORT3 PIN23 (coords: C2) is configured as FC2_CTS_SDA_SSEL0 */
	IOCON_PinMuxSet(IOCON, 3U, 23U, port3_pin23_config);

	const uint32_t port3_pin24_config = (/* Pin is configured as FC2_RTS_SCL_SSEL1 */
			IOCON_PIO_FUNC1 |
			/* I2C mode */
			IOCON_PIO_I2CSLEW_I2C |
			/* Input function is not inverted */
			IOCON_PIO_INV_DI |
			/* Enables digital function */
			IOCON_PIO_DIGITAL_EN |
			/* Input filter disabled */
			IOCON_PIO_INPFILT_OFF |
			/* High drive: 20 mA */
			IOCON_PIO_I2CDRIVE_HIGH |
			/* I2C 50 ns glitch filter enabled */
			IOCON_PIO_I2CFILTER_EN);
	/* PORT3 PIN24 (coords: E2) is configured as FC2_RTS_SCL_SSEL1 */
	IOCON_PinMuxSet(IOCON, 3U, 24U, port3_pin24_config);

	const uint32_t port3_pin25_config = (/* Pin is configured as EMC_A(14) */
			IOCON_PIO_FUNC6 |
			/* No addition pin function */
			IOCON_PIO_MODE_INACT |
			/* Input function is not inverted */
			IOCON_PIO_INV_DI |
			/* Enables digital function */
			IOCON_PIO_DIGITAL_EN |
			/* Input filter disabled */
			IOCON_PIO_INPFILT_OFF |
			/* Fast mode, slew rate control is disabled */
			IOCON_PIO_SLEW_FAST |
			/* Open drain is disabled */
			IOCON_PIO_OPENDRAIN_DI);
	/* PORT3 PIN25 (coords: P9) is configured as EMC_A(14) */
	IOCON_PinMuxSet(IOCON, 3U, 25U, port3_pin25_config);

	const uint32_t port3_pin5_config = (/* Pin is configured as LCD_VD(19) */
			IOCON_PIO_FUNC1 |
			/* No addition pin function */
			IOCON_PIO_MODE_INACT |
			/* Input function is not inverted */
			IOCON_PIO_INV_DI |
			/* Enables digital function */
			IOCON_PIO_DIGITAL_EN |
			/* Input filter disabled */
			IOCON_PIO_INPFILT_OFF |
			/* Standard mode, output slew rate control is enabled */
			IOCON_PIO_SLEW_STANDARD |
			/* Open drain is disabled */
			IOCON_PIO_OPENDRAIN_DI);
	/* PORT3 PIN5 (coords: B10) is configured as LCD_VD(19) */
	IOCON_PinMuxSet(IOCON, 3U, 5U, port3_pin5_config);

	const uint32_t port3_pin6_config = (/* Pin is configured as LCD_VD(20) */
			IOCON_PIO_FUNC1 |
			/* No addition pin function */
			IOCON_PIO_MODE_INACT |
			/* Input function is not inverted */
			IOCON_PIO_INV_DI |
			/* Enables digital function */
			IOCON_PIO_DIGITAL_EN |
			/* Input filter disabled */
			IOCON_PIO_INPFILT_OFF |
			/* Standard mode, output slew rate control is enabled */
			IOCON_PIO_SLEW_STANDARD |
			/* Open drain is disabled */
			IOCON_PIO_OPENDRAIN_DI);
	/* PORT3 PIN6 (coords: C9) is configured as LCD_VD(20) */
	IOCON_PinMuxSet(IOCON, 3U, 6U, port3_pin6_config);

	const uint32_t port3_pin7_config = (/* Pin is configured as LCD_VD(21) */
			IOCON_PIO_FUNC1 |
			/* No addition pin function */
			IOCON_PIO_MODE_INACT |
			/* Input function is not inverted */
			IOCON_PIO_INV_DI |
			/* Enables digital function */
			IOCON_PIO_DIGITAL_EN |
			/* Input filter disabled */
			IOCON_PIO_INPFILT_OFF |
			/* Standard mode, output slew rate control is enabled */
			IOCON_PIO_SLEW_STANDARD |
			/* Open drain is disabled */
			IOCON_PIO_OPENDRAIN_DI);
	/* PORT3 PIN7 (coords: B8) is configured as LCD_VD(21) */
	IOCON_PinMuxSet(IOCON, 3U, 7U, port3_pin7_config);

	const uint32_t port3_pin8_config = (/* Pin is configured as LCD_VD(22) */
			IOCON_PIO_FUNC1 |
			/* No addition pin function */
			IOCON_PIO_MODE_INACT |
			/* Input function is not inverted */
			IOCON_PIO_INV_DI |
			/* Enables digital function */
			IOCON_PIO_DIGITAL_EN |
			/* Input filter disabled */
			IOCON_PIO_INPFILT_OFF |
			/* Standard mode, output slew rate control is enabled */
			IOCON_PIO_SLEW_STANDARD |
			/* Open drain is disabled */
			IOCON_PIO_OPENDRAIN_DI);
	/* PORT3 PIN8 (coords: A7) is configured as LCD_VD(22) */
	IOCON_PinMuxSet(IOCON, 3U, 8U, port3_pin8_config);

	const uint32_t port3_pin9_config = (/* Pin is configured as LCD_VD(23) */
			IOCON_PIO_FUNC1 |
			/* No addition pin function */
			IOCON_PIO_MODE_INACT |
			/* Input function is not inverted */
			IOCON_PIO_INV_DI |
			/* Enables digital function */
			IOCON_PIO_DIGITAL_EN |
			/* Input filter disabled */
			IOCON_PIO_INPFILT_OFF |
			/* Standard mode, output slew rate control is enabled */
			IOCON_PIO_SLEW_STANDARD |
			/* Open drain is disabled */
			IOCON_PIO_OPENDRAIN_DI);
	/* PORT3 PIN9 (coords: C7) is configured as LCD_VD(23) */
	IOCON_PinMuxSet(IOCON, 3U, 9U, port3_pin9_config);
}

/* clang-format off */
/*
 * TEXT BELOW IS USED AS SETTING FOR TOOLS *************************************
BOARD_InitUserPins:
- options: {callFromInitBoot: 'true', coreID: core0, enableClock: 'true'}
- pin_list:
  - {pin_num: J14, peripheral: SCT0, signal: 'OUT, 5', pin_signal: PIO3_31/FC9_RTS_SCL_SSEL1/SCT0_OUT5/CTIMER4_MAT2/SCT0_GPI0/EMC_A(20)}
 * BE CAREFUL MODIFYING THIS COMMENT - IT IS YAML SETTINGS FOR TOOLS ***********
 */
/* clang-format on */

/* FUNCTION ************************************************************************************************************
 *
 * Function Name : BOARD_InitUserPins
 * Description   : Configures pin routing and optionally pin electrical features.
 *
 * END ****************************************************************************************************************/
/* Function assigned for the Cortex-M4F */
void BOARD_InitUserPins(void)
{
	/* Enables the clock for the IOCON block. 0 = Disable; 1 = Enable.: 0x01u */
	CLOCK_EnableClock(kCLOCK_Iocon);

	IOCON->PIO[3][31] = ((IOCON->PIO[3][31] &
			/* Mask bits to zero which are setting */
			(~(IOCON_PIO_FUNC_MASK | IOCON_PIO_DIGIMODE_MASK)))

			/* Selects pin function.
			 * : PORT331 (pin J14) is configured as SCT0_OUT5. */
			| IOCON_PIO_FUNC(PIO331_FUNC_ALT2)

			/* Select Analog/Digital mode.
			 * : Digital mode. */
			| IOCON_PIO_DIGIMODE(PIO331_DIGIMODE_DIGITAL));
}
/***********************************************************************************************************************
 * EOF
 **********************************************************************************************************************/
